app/views/books/_index.html.erb

        <td>
         <p><%= link_to "#{book.book_comments.count} コメント" %></p>
---
SELECT "books".* FROM "books"