app/views/books/_index.html.erb

         <%= link_to book_favorites_path(book.id), method: :delete, remote: true do %>
         ♥<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

          <%= link_to book_favorites_path(book.id), method: :post, remote: true do %>
            ♡<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

        <td>
         <p><%= link_to "#{book.book_comments.count} コメント" %></p>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]