app/views/books/show.html.erb

               <%= link_to book_favorites_path(@book.id), method: :delete, remote: true do %>
               ♥<%= @book.favorites.count %> いいねを取り消す
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

                <%= link_to book_favorites_path(@book.id), method: :post, remote: true do %>
                  ♡<%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

      <div class="comments">
      <p>コメント件数：<%= @book.book_comments.count %></p>
        <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]