app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ss"], ["user_id", 2], ["book_id", 1], ["created_at", "2021-05-04 09:31:43.626027"], ["updated_at", "2021-05-04 09:31:43.626027"]]